apache/nuttx/arch/risc-v/src/bl602/hardware/bl602_ef.h
#define EF_DATA_1_REG_DATA_1_LOCK_RD_LOCK_KEY_SLOT_9  (1 << 29)
#define EF_DATA_1_REG_DATA_1_LOCK_RD_LOCK_KEY_SLOT_8  (1 << 28)
#define EF_DATA_1_REG_DATA_1_LOCK_RD_LOCK_KEY_SLOT_7  (1 << 27)
#define EF_DATA_1_REG_DATA_1_LOCK_RD_LOCK_KEY_SLOT_6  (1 << 26)
#define EF_DATA_1_REG_DATA_1_LOCK_WR_LOCK_KEY_SLOT_9  (1 << 13)
#define EF_DATA_1_REG_DATA_1_LOCK_WR_LOCK_KEY_SLOT_8  (1 << 12)
#define EF_DATA_1_REG_DATA_1_LOCK_WR_LOCK_KEY_SLOT_7  (1 << 11)
#define EF_DATA_1_REG_DATA_1_LOCK_WR_LOCK_KEY_SLOT_6  (1 << 10)

#define EF_IF_CTRL_0_EF_IF_PROT_CODE_CYC_SHIFT       (24)
#define EF_IF_CTRL_0_EF_IF_PROT_CODE_CYC_MASK        (0xff << EF_IF_CTRL_0_EF_IF_PROT_CODE_CYC_SHIFT)
#define EF_IF_CTRL_0_EF_IF_0_INT_SET                 (1 << 22)
#define EF_IF_CTRL_0_EF_IF_0_INT_CLR                 (1 << 21)
#define EF_IF_CTRL_0_EF_IF_0_INT                     (1 << 20)
#define EF_IF_CTRL_0_EF_IF_CYC_MODIFY_LOCK           (1 << 19)
#define EF_IF_CTRL_0_EF_IF_AUTO_RD_EN                (1 << 18)
#define EF_IF_CTRL_0_EF_CLK_SAHB_DATA_GATE           (1 << 17)
#define EF_IF_CTRL_0_EF_IF_POR_DIG                   (1 << 16)
#define EF_IF_CTRL_0_EF_IF_PROT_CODE_CTRL_SHIFT      (8)
#define EF_IF_CTRL_0_EF_IF_PROT_CODE_CTRL_MASK       (0xff << EF_IF_CTRL_0_EF_IF_PROT_CODE_CTRL_SHIFT)
#define EF_IF_CTRL_0_EF_CLK_SAHB_DATA_SEL            (1 << 7)
#define EF_IF_CTRL_0_EF_IF_0_CYC_MODIFY              (1 << 6)
#define EF_IF_CTRL_0_EF_IF_0_MANUAL_EN               (1 << 5)
#define EF_IF_CTRL_0_EF_IF_0_TRIG                    (1 << 4)
#define EF_IF_CTRL_0_EF_IF_0_RW                      (1 << 3)
#define EF_IF_CTRL_0_EF_IF_0_BUSY                    (1 << 2)
#define EF_IF_CTRL_0_EF_IF_0_AUTOLOAD_DONE           (1 << 1)
#define EF_IF_CTRL_0_EF_IF_0_AUTOLOAD_P1_DONE        (1 << 0)

#define EF_IF_CYC_0_EF_IF_CYC_PD_CS_S_SHIFT          (24)
#define EF_IF_CYC_0_EF_IF_CYC_PD_CS_S_MASK           (0xff << EF_IF_CYC_0_EF_IF_CYC_PD_CS_S_SHIFT)
#define EF_IF_CYC_0_EF_IF_CYC_CS_SHIFT               (18)
#define EF_IF_CYC_0_EF_IF_CYC_CS_MASK                (0x3f << EF_IF_CYC_0_EF_IF_CYC_CS_SHIFT)
#define EF_IF_CYC_0_EF_IF_CYC_RD_ADR_SHIFT           (12)
#define EF_IF_CYC_0_EF_IF_CYC_RD_ADR_MASK            (0x3f << EF_IF_CYC_0_EF_IF_CYC_RD_ADR_SHIFT)
#define EF_IF_CYC_0_EF_IF_CYC_RD_DAT_SHIFT           (6)
#define EF_IF_CYC_0_EF_IF_CYC_RD_DAT_MASK            (0x3f << EF_IF_CYC_0_EF_IF_CYC_RD_DAT_SHIFT)
#define EF_IF_CYC_0_EF_IF_CYC_RD_DMY_MASK            (0x3f)

#define EF_IF_CYC_1_EF_IF_CYC_PD_CS_H_SHIFT          (26)
#define EF_IF_CYC_1_EF_IF_CYC_PD_CS_H_MASK           (0x3f << EF_IF_CYC_1_EF_IF_CYC_PD_CS_H_SHIFT)
#define EF_IF_CYC_1_EF_IF_CYC_PS_CS_SHIFT            (20)
#define EF_IF_CYC_1_EF_IF_CYC_PS_CS_MASK             (0x3f << EF_IF_CYC_1_EF_IF_CYC_PS_CS_SHIFT)
#define EF_IF_CYC_1_EF_IF_CYC_WR_ADR_SHIFT           (14)
#define EF_IF_CYC_1_EF_IF_CYC_WR_ADR_MASK            (0x3f << EF_IF_CYC_1_EF_IF_CYC_WR_ADR_SHIFT)
#define EF_IF_CYC_1_EF_IF_CYC_PP_SHIFT               (6)
#define EF_IF_CYC_1_EF_IF_CYC_PP_MASK                (0xff << EF_IF_CYC_1_EF_IF_CYC_PP_SHIFT)
#define EF_IF_CYC_1_EF_IF_CYC_PI_MASK                (0x3f)

#define EF_IF_0_MANUAL_EF_IF_PROT_CODE_MANUAL_SHIFT  (24)
#define EF_IF_0_MANUAL_EF_IF_PROT_CODE_MANUAL_MASK   (0xff << EF_IF_0_MANUAL_EF_IF_PROT_CODE_MANUAL_SHIFT)
#define EF_IF_0_MANUAL_EF_IF_0_Q_SHIFT               (16)
#define EF_IF_0_MANUAL_EF_IF_0_Q_MASK                (0xff << EF_IF_0_MANUAL_EF_IF_0_Q_SHIFT)
#define EF_IF_0_MANUAL_EF_IF_CSB                     (1 << 15)
#define EF_IF_0_MANUAL_EF_IF_LOAD                    (1 << 14)
#define EF_IF_0_MANUAL_EF_IF_PGENB                   (1 << 13)
#define EF_IF_0_MANUAL_EF_IF_STROBE                  (1 << 12)
#define EF_IF_0_MANUAL_EF_IF_PS                      (1 << 11)
#define EF_IF_0_MANUAL_EF_IF_PD                      (1 << 10)
#define EF_IF_0_MANUAL_EF_IF_A_MASK                  (0x3ff)

#define EF_IF_CFG_0_EF_IF_DBG_MODE_SHIFT             (28)
#define EF_IF_CFG_0_EF_IF_DBG_MODE_MASK              (0x0f << EF_IF_CFG_0_EF_IF_DBG_MODE_SHIFT)
#define EF_IF_CFG_0_EF_IF_DBG_JTAG_0_DIS_SHIFT       (26)
#define EF_IF_CFG_0_EF_IF_DBG_JTAG_0_DIS_MASK        (0x03 << EF_IF_CFG_0_EF_IF_DBG_JTAG_0_DIS_SHIFT)
#define EF_IF_CFG_0_EF_IF_DBG_JTAG_1_DIS_SHIFT       (24)
#define EF_IF_CFG_0_EF_IF_DBG_JTAG_1_DIS_MASK        (0x03 << EF_IF_CFG_0_EF_IF_DBG_JTAG_1_DIS_SHIFT)
#define EF_IF_CFG_0_EF_IF_EFUSE_DBG_DIS              (1 << 23)
#define EF_IF_CFG_0_EF_IF_SE_DBG_DIS                 (1 << 22)
#define EF_IF_CFG_0_EF_IF_CPU_RST_DBG_DIS            (1 << 21)
#define EF_IF_CFG_0_EF_IF_CPU1_DIS                   (1 << 20)
#define EF_IF_CFG_0_EF_IF_SF_DIS                     (1 << 19)
#define EF_IF_CFG_0_EF_IF_CAM_DIS                    (1 << 18)
#define EF_IF_CFG_0_EF_IF_0_KEY_ENC_EN               (1 << 17)
#define EF_IF_CFG_0_EF_IF_WIFI_DIS                   (1 << 16)
#define EF_IF_CFG_0_EF_IF_BLE_DIS                    (1 << 15)
#define EF_IF_CFG_0_EF_IF_SDU_DIS                    (1 << 14)
#define EF_IF_CFG_0_EF_IF_SW_USAGE_1_SHIFT           (12)
#define EF_IF_CFG_0_EF_IF_SW_USAGE_1_MASK            (0x03 << EF_IF_CFG_0_EF_IF_SW_USAGE_1_SHIFT)
#define EF_IF_CFG_0_EF_IF_BOOT_SEL_SHIFT             (8)
#define EF_IF_CFG_0_EF_IF_BOOT_SEL_MASK              (0x0f << EF_IF_CFG_0_EF_IF_BOOT_SEL_SHIFT)
#define EF_IF_CFG_0_EF_IF_CPU0_ENC_EN                (1 << 7)
#define EF_IF_CFG_0_EF_IF_CPU1_ENC_EN                (1 << 6)
#define EF_IF_CFG_0_EF_IF_SBOOT_EN_SHIFT             (4)
#define EF_IF_CFG_0_EF_IF_SBOOT_EN_MASK              (0x03 << EF_IF_CFG_0_EF_IF_SBOOT_EN_SHIFT)
#define EF_IF_CFG_0_EF_IF_SBOOT_SIGN_MODE_SHIFT      (2)
#define EF_IF_CFG_0_EF_IF_SBOOT_SIGN_MODE_MASK       (0x03 << EF_IF_CFG_0_EF_IF_SBOOT_SIGN_MODE_SHIFT)
#define EF_IF_CFG_0_EF_IF_SF_AES_MODE_MASK           (0x03)

#define EF_SW_CFG_0_EF_SW_DBG_MODE_SHIFT             (28)
#define EF_SW_CFG_0_EF_SW_DBG_MODE_MASK              (0x0f << EF_SW_CFG_0_EF_SW_DBG_MODE_SHIFT)
#define EF_SW_CFG_0_EF_SW_DBG_JTAG_0_DIS_SHIFT       (26)
#define EF_SW_CFG_0_EF_SW_DBG_JTAG_0_DIS_MASK        (0x03 << EF_SW_CFG_0_EF_SW_DBG_JTAG_0_DIS_SHIFT)
#define EF_SW_CFG_0_EF_SW_DBG_JTAG_1_DIS_SHIFT       (24)
#define EF_SW_CFG_0_EF_SW_DBG_JTAG_1_DIS_MASK        (0x03 << EF_SW_CFG_0_EF_SW_DBG_JTAG_1_DIS_SHIFT)
#define EF_SW_CFG_0_EF_SW_EFUSE_DBG_DIS              (1 << 23)
#define EF_SW_CFG_0_EF_SW_SE_DBG_DIS                 (1 << 22)
#define EF_SW_CFG_0_EF_SW_CPU_RST_DBG_DIS            (1 << 21)
#define EF_SW_CFG_0_EF_SW_CPU1_DIS                   (1 << 20)
#define EF_SW_CFG_0_EF_SW_SF_DIS                     (1 << 19)
#define EF_SW_CFG_0_EF_SW_CAM_DIS                    (1 << 18)
#define EF_SW_CFG_0_EF_SW_0_KEY_ENC_EN               (1 << 17)
#define EF_SW_CFG_0_EF_SW_WIFI_DIS                   (1 << 16)
#define EF_SW_CFG_0_EF_SW_BLE_DIS                    (1 << 15)
#define EF_SW_CFG_0_EF_SW_SDU_DIS                    (1 << 14)
#define EF_SW_CFG_0_EF_SW_SW_USAGE_1_SHIFT           (12)
#define EF_SW_CFG_0_EF_SW_SW_USAGE_1_MASK            (0x03 << EF_SW_CFG_0_EF_SW_SW_USAGE_1_SHIFT)
#define EF_SW_CFG_0_EF_SW_CPU0_ENC_EN                (1 << 7)
#define EF_SW_CFG_0_EF_SW_CPU1_ENC_EN                (1 << 6)
#define EF_SW_CFG_0_EF_SW_SBOOT_EN_SHIFT             (4)
#define EF_SW_CFG_0_EF_SW_SBOOT_EN_MASK              (0x03 << EF_SW_CFG_0_EF_SW_SBOOT_EN_SHIFT)
#define EF_SW_CFG_0_EF_SW_SBOOT_SIGN_MODE_SHIFT      (2)
#define EF_SW_CFG_0_EF_SW_SBOOT_SIGN_MODE_MASK       (0x03 << EF_SW_CFG_0_EF_SW_SBOOT_SIGN_MODE_SHIFT)
#define EF_SW_CFG_0_EF_SW_SF_AES_MODE_MASK           (0x03)

#define EF_CRC_CTRL_0_EF_CRC_SLP_N_SHIFT             (16)
#define EF_CRC_CTRL_0_EF_CRC_SLP_N_MASK              (0xffff << EF_CRC_CTRL_0_EF_CRC_SLP_N_SHIFT)
#define EF_CRC_CTRL_0_EF_CRC_LOCK                    (1 << 11)
#define EF_CRC_CTRL_0_EF_CRC_INT_SET                 (1 << 10)
#define EF_CRC_CTRL_0_EF_CRC_INT_CLR                 (1 << 9)
#define EF_CRC_CTRL_0_EF_CRC_INT                     (1 << 8)
#define EF_CRC_CTRL_0_EF_CRC_DIN_ENDIAN              (1 << 7)
#define EF_CRC_CTRL_0_EF_CRC_DOUT_ENDIAN             (1 << 6)
#define EF_CRC_CTRL_0_EF_CRC_DOUT_INV_EN             (1 << 5)
#define EF_CRC_CTRL_0_EF_CRC_ERROR                   (1 << 4)
#define EF_CRC_CTRL_0_EF_CRC_MODE                    (1 << 3)
#define EF_CRC_CTRL_0_EF_CRC_EN                      (1 << 2)
#define EF_CRC_CTRL_0_EF_CRC_TRIG                    (1 << 1)
#define EF_CRC_CTRL_0_EF_CRC_BUSY                    (1 << 0)

#endif /* __ARCH_RISCV_SRC_BL602_HARDWARE_BL602_EF_H */
